Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/maintenance_orders_and_agreements.html.txt.tmx
Source language: en
Languages: ga

source: Maintenance orders and agreements
ga: Orduithe agus comhaontuithe cothabhála

source: There is a legal responsibility on parents, whether married or unmarried, to maintain dependent children and on spouses/civil partners to maintain each other in accordance with their means
ga: Tá freagracht dhlíthiúil in Éirinn ar thuismitheoirí, cibé acu pósta nó neamhphósta, chun leanaí cleithiúnacha a chothabháil agus ar chéilí/pháirtnéirí sibhialta chun a chéile a chothabháil i gcomhréir lena n-acmhainní

source: Maintenance can be paid periodically (i.e., weekly or monthly) or in a lump sum
ga: Is féidir cothabháil a íoc go tréimhsiúil (i.e. go seachtainiúil nó go míosúil) nó i gcnapshuim

source: Paying maintenance does not in itself give a parent access or guardianship rights
ga: Ní bhronntar cearta rochtana nó caomhnóireachta ar thuismitheoir díreach mar gheall go bhfuil cothabháil a híoc acu

source: Under the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010, a financially dependent qualified cohabitant may be able to apply to the courts for a maintenance order if the relationship ends
ga: Faoin Acht um Páirtnéireacht Shibhialta agus um Chearta agus Oibleagáidí Áirithe de chuid Comhchónaitheoirí, 2010, d’fhéadfadh comháithritheoir cáilithe atá neamhspleách ó thaobh airgeadais de, bheith in ann iarratas a dhéanamh ar na cúirteanna ar ordú cothabhála má chuirtear deireadh leis an gcaidreamh

source: See our document on the redress scheme for cohabiting couples
ga: Léigh ár gcáipéis ar an scéim chúitimh do lánúineacha comhchónaitheacha

source: In situations where parents or spouses/civil partners are separated, they can make informal agreements regarding maintenance
ga: I gcásanna ina bhfuil tuismitheoirí nó céilí/páirtnéirí sibhialta idirscartha, féadfaidh siad comhaontuithe neamhfhoirmiúla a dhéanamh maidir le cothabháil

source: This can work well where both parties are reasonable and fair - but it is difficult to assess informally how much maintenance should be paid
ga: D’fhéadfadh go n-éireodh go geal leis seo sa chás go bhfuil an dá pháirtí réasúnta agus cothrom – ach is deacair measúnú neamhfhoirmiúil a dhéanamh ar cé mhéid cothabhála is ceart a íoc

source: You might consider sitting down and writing out the actual expenses (weekly, monthly, etc.)
ga: B’fhéidir go ndéanfá machnamh ar shuí síos agus na costais féin a scríobh amach (sa tseachtain, sa mhí, etc.)

source: If you find it difficult to come to an arrangement which satisfies both parties, you may find that mediation can help
ga: Más deacair duit teacht ar chomhaontú a shásaíonn an dá pháirtí, b’fhéidir go dtabharfá faoi deara gur féidir le hidirghabháil cabhrú leat

source: Alternatively, each side can engage their own legal advice who will act as negotiator of an agreement
ga: Mar mhalairt air sin, féadfaidh gach taobh a gcomhairle dlí féin a fhostú a ghníomhóidh mar idirbheartaí ar chomhaontú

source: Both parties can then sign this agreement which can later be made a rule of court
ga: Féadfaidh an dá pháirtí an comhaontú seo a shíniú, ar féidir riail chúirte a dhéanamh de níos déanaí

source: A rule of court means that these agreements have the same effect as a maintenance order (see below)
ga: Ciallaíonn riail chúirte go mbeidh an éifeacht chéanna ag na comhaontuithe seo le hordú cothabhála (féach thíos)

source: A solicitor cannot act for both sides in this situation, given that there may be conflicts of interest
ga: Ní féidir le haturnae feidhmiú don bheirt tuismitheoirí sa chás sin, mar gheall go bhféadfadh coimhlint leasa a bheith i gceist

source: Informal agreements such as this can include a property transfer or a lump sum payment but it cannot rule out the possibility of applying for a maintenance order through the courts in the future
ga: Is féidir le haistriú maoine nó íocaíocht chnapshuime a bheith i gceist in aontuithe neamhfhoirmiúla ar nós seo, ach ní féidir leis fáil réidh leis an bhféidearthacht iarratas a dhéanamh ar ordú cothabhála trí na cúirteanna amach anseo

source: If the parties cannot agree upon maintenance, either party can apply to court for a maintenance order
ga: Murar féidir leis na páirtithe comhaontú ar chothabháil, is féidir le ceachtar páirtí iarratas a dhéanamh ar ordú cothabhála sa chúirt

source: An application for maintenance can be brought either in the District or Circuit Court
ga: Is féidir iarratas i gcomhair cothabhála a dhéanamh sa Chúirt Dúiche nó sa Chúirt Chuarda

source: A person seeking a maintenance order can represent himself or herself
ga: Is féidir le duine atá ag lorg ordú cothabhála ionadaíocht a dhéanamh dó nó di féin

source: However, a person seeking a maintenance order should always check to see if they are eligible for legal aid or contact a private solicitor to assess the cost of the application
ga: Ba chóir do dhuine atá ag lorg ordú cothabhála, áfach, seiceáil i gcónaí an bhfuil siad i dteideal cúnamh dlíthiúil a fháil, nó dul i dteagmháil le haturnae príobháideach chun costas an iarratais a mheas

source: The cost of the application can be awarded against the party refusing to pay maintenance if a judge considers it appropriate
ga: Is féidir costas an iarratais a thabhairt i gcoinne an pháirtí a bhí ag diúltú cothabháil a íoc má cheapann breitheamh go bhfuil seo cuí

source: Maintenance can be awarded to a spouse/civil partner for their own benefit and/or for the benefit of a dependent child who is under the age of 18, or 23 if the child is in full-time education
ga: Tá cothabháil a bhronntar ar pháirtnéir sibhialta ar mhaithe leo féin agus tá cothabháil a bhronntar ar thuismitheoir neamhphósta ar mhaithe lena leanbh

source: If the child is over 18 and under 23 and the financial circumstances do not allow him/her to attend further education, maintenance can be applied for in order to facilitate further education
ga: Is féidir cothabháil a bhronnadh ar chéile/páirtnéir sibhialta ar mhaithe leo féin agus/nó ar mhaithe leis an leanbh cleithiúnach atá faoi aois 18 mbliana, nó 23 bliain má tá an leanbh in oideachas lánaimseartha

source: If the child has a mental or physical disability to such a degree that it will not be possible for the child to maintain him/herself fully, then there is no age limit for seeking maintenance for their support
ga: Má tá an leanbh os cionn 18 mbliana d’aois agus faoi bhun 23 bliain agus mura ligeann na cúinsí airgeadais dó/di freastal ar bhreis oideachais, féadtar cothabháil a chur i bhfeidhm chun breis oideachais a éascú

source: Each party must disclose their finances to the court and the judge will consider all of the family's circumstances when making a maintenance order
ga: Ní mór do gach páirtí a gcuid airgeadais a nochtadh don chúirt, agus déanfaidh an breitheamh cúinsí uile an teaghlaigh a chur san áireamh agus ordú cothabhála á dhéanamh aige/aici

source: Enforcing a maintenance order
ga: Ordú cothabhála a fhorfheidhmiú

source: In cases where a parent/spouse/civil partner fails to comply with a court order and does not pay the amount awarded, an attachment of earnings order can be sought from the court, if the person is in employment or on a private pension
ga: I gcásanna ina dteipeann ar thuismitheoir/chéile/pháirtnéir sibhialta ordú cúirte a chomhlíonadh agus nach n-íocann sé/sí an méid a dámhadh, féadtar ordú astú tuillimh a lorg ón gcúirt, má tá an duine fostaithe nó má tá pinsean príobháideach á fháil aige/aici

source: This order results in the maintenance amount being deducted at source by the parent's/spouse's/civil partner's employer
ga: Is éard a eascraíonn as an ordú seo ná go n-asbhaineann fostóir an tuismitheora/an chéile/an pháirtnéara shibhialta suim na cothabhála ag an bhfoinse

source: If the parent/spouse/civil partner is self-employed, an enforcement summons can be applied for
ga: Má tá tuismitheoir/céile/páirtnéir sibhialta féinfhostaithe, féadtar iarratas a dhéanamh ar toghairm forfheidhmithe

source: The Civil Law (Miscellaneous Provisions) Act 2011 has amended the legislation to give the District Court the power to regard a failure by a parent/spouse/civil partner to comply with a court order as contempt of court and to deal with it accordingly, including by means of imprisonment
ga: Leasaigh an tAcht um an Dlí Sibhialta (Forálacha Ilghnéitheacha), 2011 an reachtaíocht chun an chumhacht a thabhairt don Chúirt Dúiche maidir le teip ar thuismitheoir/chéile/pháirtnéir sibhialta chun ordú cúirte a chomhlíonadh mar dhíspeagadh cúirte agus chun déileáil leis dá réir, lena n-áirítear trí phríosúnacht

source: The District Court in making a maintenance order can direct that the payment under the order be made to the District Court Clerk if the court considers that it would be proper to do so
ga: Is féidir leis an gCúirt Dúiche, agus ordú cothabhála a dhéanamh, a threorú go ndéanfaí an íocaíocht faoin ordú le Cléireach na Cúirte Dúiche má cheapann an chúirt go mbeadh sé cuí sin a dhéanamh

source: The Circuit Court may as part of its order direct that a maintenance order is payable through the District Court
ga: Is féidir leis an gCúirt Chuarda, mar chuid dá hordú, a threorú go mbeidh ordú cothabhála iníoctha tríd an gCúirt Dúiche

source: The District Court has a fully computerised payments system for the receipt and transmission of payments received
ga: Tá córas íocaíochtaí ag an gCúirt Dúiche atá go hiomlán ríomhairithe chun íocaíochtaí a fhaightear a fháil agus a tharchur

source: Maintenance following separation, divorce and dissolution
ga: Cothabháil tar éis idirscartha, colscartha agus díscaoilte

source: Under Irish law, there is no clean break from the obligation to support one's spouse/civil partner and children
ga: Faoi dhlí na hÉireann, níl aon bhriseadh glan ann ón dualgas atá ar dhuine chun tacú lena chéile/pháirtnéir sibhialta agus lena leanaí

source: A clause in a separation agreement stating that a spouse/civil partner will not seek maintenance in the future or seek increased maintenance is unenforceable
ga: Ní féidir clásal i gcomhaontú idirscartha a luann nach ndéanfaidh céile/páirtí sibhialta cothabháil a lorg amach anseo nó méadú ar chothabháil a lorg a chur i bhfeidhm

source: The spouse/civil partner can apply for a maintenance order and a court will consider this application, particularly if the circumstances of the parties have changed or the spouse/civil partner who executed the agreement did not have legal advice at the time
ga: Féadfaidh an céile/páirtnéir sibhialta iarratas a dhéanamh ar ordú cothabhála agus déanfaidh cúirt breithniú ar an iarratas seo, go háirithe má tháinig athrú ar chúinsí na bpáirtithe nó mura raibh an chomhairle dlí ag an tráth sin ag an gcéile/bpáirtnéir sibhialta a d’fhorghníomhaigh an comhaontú

source: A divorced spouse can also apply to a court for a maintenance order or a variation of a maintenance order after the divorce decree has been granted
ga: Féadfaidh céile colscartha, ina theannta sin, iarratas a dhéanamh ar chúirt ar ordú cothabhála nó ar leagan d’ordú cothabhála i ndiaidh gur deonaíodh an fhoraithne cholscartha

source: Similarly, a former civil partner can apply to the court for a maintenance order or a variation of a maintenance order after the dissolution decree has been granted
ga: Ar an gcuma chéanna, féadfaidh iar-pháirtnéir sibhialta iarratas a dhéanamh ar an gcúirt ar ordú cothabhála nó ar leagan d’ordú cothabhála i ndiaidh gur deonaíodh an fhoraithne dhíscaoilte

source: The only bar to an application is where the the spouse/civil partner applying for the order has remarried or entered into a new civil partnership
ga: Is é an t-aon urchosc atá ar iarratas ná athphósadh an chéile/an pháirtnéara shibhialta atá ag lorg an ordaithe nó má iontrálann sé/sí i bpáirtnéireacht shibhialta nua

source: Ireland is party to various international conventions and there are also EU Regulations which facilitate the recovery of maintenance from abroad
ga: Tá Éire ina páirtí le coinbhinsiúin éagsúla idirnáisiúnta agus tá Rialacháin AE ann chomh maith a éascaíonn cothabháil a aisghabháil ó áiteanna thar lear

source: See our document on the EU and family law
ga: Léigh ár gcáipéis ar an An AE agus an dlí teaghlaigh

source: If you wish to obtain maintenance from someone living abroad, contact the Central Authority for Maintenance Recovery in the Department of Justice and Equality for help - see 'Contacts' below
ga: Más mian leat cothabháil a fháil ó dhuine a chónaíonn thar lear, déan teagmháil leis an Údarás Lárnach um Aisghabháil Cothabhála sa Roinn Dlí agus Cirt agus Comhionannais – féach ‘Teagmhálaithe’ thíos

source: You must have an address for the other party
ga: Ní mór go bhfuil seoladh agat don pháirtí eile

source: If you wish to appeal the decision of the court about a maintenance order, you can do so within 14 days or apply to the court for an extension of time to appeal
ga: Más mian leat achomharc a dhéanamh ar chinneadh na cúirte faoi ordú cothabhála, féadfaidh tú amhlaidh a dhéanamh laistigh de 14 lá nó iarratas a dhéanamh ar an gcúirt ar shíneadh ama chun achomharc a dhéanamh

source: You should seek legal advice regarding your appeal
ga: Ba cheart duit comhairle dlí a lorg maidir le d’achomharc

source: If both parties agree, the amount of maintenance to be paid can be agreed between the parties
ga: Má chomhaontaíonn an dá pháirtí, is féidir an méid cothabhála atá le híoc a chomhaontú idir na páirtithe

source: If the parties cannot agree on the amount of maintenance to be paid, it will be necessary to apply to the District or Circuit Court, depending on the amount of maintenance that is sought
ga: Murar féidir leis na páirtithe comhaontú ar an méid cothabhála atá le híoc, beidh gá le hiarratas a dhéanamh ar an gCúirt Dúiche nó ar an gCúirt Chuarda, ag brath ar an méid cothabhála atá á lorg

source: At present, the District Court can award any amount up to €500 per week for a spouse/civil partner, and €150 per week for each child
ga: Faoi láthair, is féidir leis an gCúirt Dúiche aon tsuim a mhéid le €500 sa tseachtain a bhronnadh ar chéile/pháirtnéir sibhialta, agus €150 sa tseachtain i gcomhair gach linbh

source: If sums greater than these amounts are being sought, you will need to apply to the Circuit Court
ga: Má bhíonn suimeanna níos mó ná seo á lorg, beidh ort iarratas a dhéanamh ar an gCúirt Chuarda

source: Varying the amount of maintenance
ga: Méid na cothabhála a athrú

source: It is advisable to update weekly maintenance payments annually
ga: Moltar íocaíochtaí cothabhála seachtainiúla a thabhairt cothrom le dáta gach bliain

source: Where maintenance orders have been made through the courts, either party can at a later date apply to the court to have the amount varied
ga: Sa chás go ndearnadh orduithe cothabhála trí na cúirteanna, féadfaidh ceachtar páirtí iarratas a dhéanamh ar an gcúirt ag dáta níos déanaí go n-athrófar an méid

source: (Varied means having the amount increased or decreased)
ga: (Ciallaíonn athrú go ndéanfaí an méid a mhéadú nó a laghdú)

source: In order to do this, you will require a variation order
ga: Chun é seo a dhéanamh, teastóidh ordú athraithe uait

source: If a parent/spouse/civil partner falls behind with payments where there is a maintenance order in place, then it is possible to apply to the court for an attachment of earnings summons
ga: Mura n-íocann tuismitheoir/céile/páirtnéir sibhialta as gach íocaíocht go tráthúil sa chás go bhfuil ordú cothabhála i bhfeidhm, is féidir iarratas a dhéanamh ar an gcúirt ar thoghairm astú tuillimh

source: It is possible to get this attachment at the time when you apply for the maintenance order if you fear there may be a default
ga: Is féidir an t-astú seo a fháil ag an tráth a dhéanann tú an t-iarratas ar an ordú cothabhála má bhíonn imní ort go bhféadfadh go mbeadh mainneachtain ann

source: (In other words, you fear that the other parent/spouse/civil partner may fail to comply with the maintenance order)
ga: (I bhfriotal eile, má bhíonn imní ort go dteipfidh ar an tuismitheoir/céile/páirtnéir sibhialta eile cloí leis an ordú cothabhála)

source: If the other parent/spouse/civil partner is self-employed, an enforcement summons can be applied for
ga: Má tá an tuismitheoir/céile/páirtnéir sibhialta eile féinfhostaithe, féadtar iarratas a dhéanamh ar toghairm forfheidhmithe

source: If the other parent/spouse/civil partner lives abroad, you should contact the Central Authority for Maintenance Recovery (see 'Contacts' below)
ga: Má chónaíonn an tuismitheoir/céile/páirtnéir sibhialta eile thar lear, ba cheart duit teagmháil a dhéanamh leis an Údarás Lárnach um Aisghabháil Cothabhála (féach ‘Teagmhálaithe’ thíos)

source: This process may be lengthy but generally involves no legal costs
ga: D’fhéadfadh an próiseas seo a bheith fadálach ach is gnách nach mbíonn aon chostais dlí i gceist leis

source: A person seeking a maintenance order can go to their local District Court and get the Court Clerk to issue a maintenance summons against the other spouse
ga: Is féidir le duine atá ag lorg ordú cothabhála dul chuig a gCúirt Dúiche áitiúil agus iarraidh ar Chléireach na Cúirte toghairm chothabhála a eisiúint i leith an chéile eile

source: Information on applying for maintenance and the forms used is available on the Courts Service website
ga: Tá fáil ar fhaisnéis ar iarratas a dhéanamh ar chothabháil agus na foirmeacha a úsáidtear ar láithreán gréasáin na Seirbhíse Cúirteanna

source: Legal advice and representation is always advisable
ga: Moltar i gcónaí comhairle dlí agus ionadaíocht a fháil

source: To enquire whether you are eligible for Legal Aid, you can contact your nearest law centre
ga: Chun fiosrúchán a dhéanamh faoi cibé acu an bhfuil nó nach bhfuil tú incháilithe do Chúnamh Dlí, déan teagmháil leis an ionad dlí is gaire duit

source: Legal Aid is not free and everyone must pay a contribution towards costs
ga: Níl cúnamh dlí saor in aisce agus tá ar gach duine ranníocaíocht a íoc i dtreo na gcostas

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách, dheonach é ICDS (Ionaid Comhairle Dlí Saor in Aisce) a oibríonn líonra de chlinicí um chomhairle dhlíthiúil ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún agus saor in aisce do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Déan teagmháil leis an Ionad um Fhaisnéis do Shaoránaigh is gaire duit chun teacht ar fhaisnéis ar sheirbhísí ICDS i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ina theannta sin, tá líne faisnéise agus atreoraithe á reáchtáil ag an ICDS le linn uaireanta oifige le haghaidh faisnéis bhunúsach dhlíthiúil

source: If you choose to hire a private solicitor, you should be aware that there is no fixed rate of charges for legal fees
ga: Ma roghnaíonn tú chun aturnae príobháideach a fháil, ba cheart duit a bheith feasach nach ann d’aon ráta seasta muirear le haghaidh táillí dlí

source: You are advised to obtain some quotes before deciding on a legal firm
ga: Moltar duit roinnt meastacháin luacha a fháil sula ndéanann tú cinneadh ar ghnóthas dlíthiúil

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá fáil ar fhaisnéis teagmhála do ghnóthais aturnaetha ar fud na hÉireann ar láithreán gréasáin Dhlí-Chumann na hÉireann
